app/controllers/collects_controller.rb

  def index
    @collects = Collect.all
---
SELECT "collects".* FROM "collects"

  def create
    @collect = Collect.new(collect_params)

    if @collect.save
---
INSERT INTO "collects" ("at", "asso", "other", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["at", "2022-12-11"], ["asso", "libe"], ["other", "{}"], ["created_at", "2022-12-09 07:23:25.861202"], ["updated_at", "2022-12-09 07:23:25.861202"]]