app/controllers/home_controller.rb

SELECT "indicators".* FROM "indicators"
---
    def index
        @indicator = Indicator.all