app/controllers/indicators_controller.rb

SELECT "indicators".* FROM "indicators" WHERE "indicators"."active" = ?  [["active", 1]]
SELECT "indicators".* FROM "indicators"
---
  def index
    if params[:status] == "active"
      @indicators = Indicator.where('active' => true)
    else
      @indicators = Indicator.all

INSERT INTO "indicators" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "jiji"], ["created_at", "2022-12-08 22:40:59.708189"], ["updated_at", "2022-12-08 22:40:59.708189"]]
---
  def create
    @indicator = Indicator.new(indicator_params)

    if @indicator.save

UPDATE "indicators" SET "active" = ?, "updated_at" = ? WHERE "indicators"."id" = ?  [["active", 1], ["updated_at", "2022-12-09 06:07:33.564649"], ["id", 3]]
---
  def update
    if @indicator.update(indicator_params)

SELECT "indicators".* FROM "indicators" WHERE "indicators"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_indicator
      @indicator = Indicator.find(params[:id])